name: "CONCANET"
layer {
  name: "input"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 4
      dim: 8
    }
  }
}
layer {
  name: "inception_a1_output"
  type: "Concat"
  bottom: "data"
  bottom: "data"
  bottom: "data"
  top: "inception_a1_output"
  phase: TEST
}
