name: "RESHAPENET"
layer {
  name: "input"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 4
      dim: 8
    }
  }
}
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "data"
  top: "output"
  reshape_param {
    shape {
      dim: 1
      dim: 96
    }
  }
}
