name: "SCALENET"
layer {
  name: "input"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 4
      dim: 8
    }
  }
}
layer {
  name: "scale1"
  type: "Scale"
  bottom: "data"
  top: "scale1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 2.71
    }
    bias_term: false
  }
}
