layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 3 dim: 16 dim: 16 } }
}
layer {
  name: "scale"
  type: "Scale"
  bottom: "data"
  top: "scale"
  scale_param {
    filler { type: "gaussian" std: 0.01 }
    bias_term: false
  }
}
