name: "FULLYCONNET"
layer {
  name: "input"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 4
      dim: 8
    }
  }
}
layer {
  name: "fc8"
  type: "InnerProduct"
  param { lr_mult: 1 decay_mult: 1 }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_term: false
  }
  bottom: "data"
  top: "fc8"
}
