name: "POOLINGMAXNET"
layer {
  name: "input"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 4
      dim: 8
    }
  }
}
layer {
  name: "inception_a1_pool"
  type: "Pooling"
  bottom: "data"
  top: "inception_a1_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
