name: "RELUNET"
layer {
  name: "input"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 4
      dim: 8
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "data"
  top: "relu1"
}
