layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape: { dim: 1 dim: 3 dim: 4 dim: 4 }
  }
}
layer {
  name: "batchnorm"
  type: "BatchNorm"
  bottom: "data"
  top: "batchnorm"
  batch_norm_param {
    use_global_stats: true
  }
}
