# HOW TO GENERATE:
#
#  import tensorflow as tf
#  value = tf.placeholder(dtype=tf.float32, shape=[1, 7, 7, 1], name='placeholder')
#  output = tf.nn.max_pool(value, [1, 3, 3, 1], [1, 2, 2, 1], 'VALID', name='maxpool2d')
#  tf.get_default_graph().as_graph_def()
#
# NOTE 1. The output shape is 1x3x3x1
#
# >>> tf.graph_util.tensor_shape_from_node_def_name(tf.get_default_graph(), 'maxpool2d')
# TensorShape([Dimension(1), Dimension(3), Dimension(3), Dimension(1)])
#
# NOTE 2. All the MaxPool nodes in inception v3 2018.04.27 use this configuration.
# - InceptionV3/InceptionV3/MaxPool_3a_3x3/MaxPool
# - InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool
# - InceptionV3/InceptionV3/Mixed_6a/Branch_2/MaxPool_1a_3x3/MaxPool
# - InceptionV3/InceptionV3/Mixed_7a/Branch_2/MaxPool_1a_3x3/MaxPool
node {
  name: "placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value { type: DT_FLOAT }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim { size: 1 }
        dim { size: 7 }
        dim { size: 7 }
        dim { size: 1 }
      }
    }
  }
}
node {
  name: "maxpool2d"
  op: "MaxPool"
  input: "placeholder"
  attr {
    key: "T"
    value { type: DT_FLOAT }
  }
  attr {
    key: "data_format"
    value { s: "NHWC" }
  }
  attr {
    key: "ksize"
    value {
      list { i: 1 i: 3 i: 3 i: 1 }
    }
  }
  attr {
    key: "padding"
    value { s: "VALID" }
  }
  attr {
    key: "strides"
    value {
      list { i: 1 i: 2 i: 2 i: 1 }
    }
  }
}
