layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape: { dim: 1 dim: 3 dim: 16 dim: 16 }
  }
}
layer {
  name: "dconv"
  type: "Convolution"
  bottom: "data"
  top: "dconv"
  convolution_param {
    group: 3
    num_output: 3
    bias_term: false
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
