layer {
  name: "data"
  type: "Input"
  top: "lhs"
  top: "rhs"
  input_param {
    shape: { dim: 1 dim: 3 dim: 16 dim: 16 }
    shape: { dim: 1 dim: 3 dim: 16 dim: 16 }
  }
}
layer {
  name: "prod"
  type: "Eltwise"
  bottom: "lhs"
  bottom: "rhs"
  top: "prod"
  eltwise_param {
    operation: PROD
  }
}
