layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape: { dim: 1 dim: 3 dim: 16 dim: 16 }
  }
}
layer {
  name: "conv"
  type: "Convolution"
  bottom: "data"
  top: "conv"
  convolution_param {
    bias_term: false
    num_output: 2
    kernel_h: 3
    kernel_w: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
