layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape: { dim: 1 dim: 3 dim: 15 dim: 15 }
  }
}
layer {
  name: "conv"
  type: "Convolution"
  bottom: "data"
  top: "conv"
  convolution_param {
    bias_term: false
    num_output: 2
    pad_h: 0
    pad_w: 3
    kernel_size: 7
  }
}
