layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 3 dim: 15 dim: 15 } }
}
layer {
  name: "pool"
  type: "Pooling"
  bottom: "data"
  top: "pool"
  pooling_param {
    pool: AVE
    kernel_h: 3
    kernel_w: 1
  }
}
